АлогистикТест2/src/Catalogs/алк_ВариантыПрипуска/алк_ВариантыПрипуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ВариантыПрипуска</name>
  <attributes>
    <name>ПрипускПоШирине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускПоТолщине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускПоДлине</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/алк_ВариантыПрипуска/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;  
	
	//Проверка на уникальность
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВариантыПрипуска.Ссылка
		|ИЗ
		|	Справочник.алк_ВариантыПрипуска КАК алк_ВариантыПрипуска
		|ГДЕ
		|	алк_ВариантыПрипуска.Ссылка <> &Ссылка
		|	И алк_ВариантыПрипуска.ПрипускПоШирине = &ПрипускПоШирине
		|	И алк_ВариантыПрипуска.ПрипускПоТолщине = &ПрипускПоТолщине
		|	И алк_ВариантыПрипуска.ПрипускПоДлине = &ПрипускПоДлине";
	
	Запрос.УстановитьПараметр("ПрипускПоДлине", ПрипускПоДлине);
	Запрос.УстановитьПараметр("ПрипускПоТолщине", ПрипускПоТолщине);
	Запрос.УстановитьПараметр("ПрипускПоШирине", ПрипускПоШирине);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("Припуск с такими данными уже существует: "  + ВыборкаДетальныеЗаписи.Ссылка);
		Отказ = Истина;
	КонецЦикла;
		
КонецПроцедуры
